Repository: Shohjakhan/Marsilino
Catalog: lib/l10n/app_*.arb
Languages: ru, uz

source: Home
ru: Главная
uz: Asosiy

source: Map
ru: Карта
uz: Xarita

source: Saved
ru: Избранное
uz: Saqlanganlar

source: Profile
ru: Профиль
uz: Profil

source: Log Out
ru: Выйти
uz: Chiqish

source: Cancel
ru: Отмена
uz: Bekor qilish

source: Logged out
ru: Вы вышли из системы
uz: Tizimdan chiqildi

source: Edit Profile
ru: Редактировать
uz: Tahrirlash

# editProfileSim
source: Edit profile (simulation)
ru: Редактирование профиля (симуляция)
uz: Profilni tahrirlash (simulyatsiya)

source: Language
ru: Язык
uz: Til

source: Redemptions
ru: Покупки
uz: Xaridlar

source: UZS Saved
ru: сэкономлено
uz: tejaldi

source: Redemption History
ru: История покупок
uz: Xaridlar tarixi

source: See all
ru: Все
uz: Barchasi

# noRedemptions
source: No redemptions yet
ru: Нет покупок
uz: Xaridlar yo'q

# noRedemptionsSub
source: Your discount redemptions will appear here
ru: Здесь будет история ваших скидок
uz: Bu yerda chegirmalar tarixi ko'rinadi

source: About
ru: О ресторане
uz: Haqida

source: Tags
ru: Теги
uz: Teglar

source: Working Hours
ru: Часы работы
uz: Ish vaqti

source: Contact
ru: Контакты
uz: Aloqa

source: Menu
ru: Меню
uz: Menyu

source: View Full Menu
ru: Посмотреть меню
uz: Menyuni ko'rish

source: Redeem Discount
ru: Получить скидку
uz: Chegirmani olish

# enterAmount
source: Please enter the bill amount
ru: Введите сумму счета
uz: Hisob summasini kiriting

# amountError
source: Amount must be greater than 0
ru: Сумма должна быть > 0
uz: Summa 0 dan katta bo'lishi kerak

# enterCode
source: Please enter the cashier code
ru: Введите код кассира
uz: Kassir kodini kiriting

# codeLengthError
source: Code must be 4 digits
ru: Код должен быть 4 цифры
uz: Kod 4 raqamdan iborat bo'lishi kerak

# codeDigitError
source: Code must contain only digits
ru: Только цифры
uz: Faqat raqamlar bo'lishi kerak

source: Redeem
ru: Активировать
uz: Faollashtirish

source: Bill Amount
ru: Сумма счета
uz: Hisob summasi

source: Cashier Code
ru: Код кассира
uz: Kassir kodi

source: Success!
ru: Успешно!
uz: Muvaffaqiyatli!

source: You saved
ru: Вы сэкономили
uz: Siz tejadingiz

source: Final bill
ru: Итого к оплате
uz: To'lov summasi

# codeExpired
source: This code has expired
ru: Код истек
uz: Kod muddati tugagan

# codeInvalid
source: Invalid cashier code
ru: Неверный код
uz: Noto'g'ri kod

# codeMismatch
source: Code does not match restaurant
ru: Неверный ресторан
uz: Noto'g'ri restoran

source: Unknown error
ru: Неизвестная ошибка
uz: Noma'lum xato

source: Try Again
ru: Попробовать снова
uz: Qayta urinish
